# 10 Minutes to pandas

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
import matplotlib.pyplot as plt

## Object Creation

Create a **Series** by passing a list of values, letting pandas create a default integer index:

In [6]:
s = pd.Series([1,2,3,np.nan,6,8])

In [7]:
print s

0     1
1     2
2     3
3   NaN
4     6
5     8
dtype: float64

 Create a **DataFrame** by passing a numpy array, with a datetime index and labeled columns:

In [8]:
dates = pd.date_range('20130101', periods=6)

In [9]:
print dates # creates a set of dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4),index=dates, 
                  columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

Create a DataFrame by passing a dict of objects that can be converted to series-like object.

In [12]:
df2 = pd.DataFrame({'A':1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test","train","test", "train"]),
                    'F': 'foo' })

In [13]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [14]:
df2.dtypes # get the types of data for each column

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [15]:
print df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

In [16]:
df.head() # top rows of the dataframe

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424

In [17]:
df.tail(3) # last three rows of the dataframe

                   A         B         C         D
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

Display the index, columns and the underlying numpy data

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [20]:
df.values

array([[-0.26828355, -1.57168142,  0.65639826, -0.17127127],
       [ 0.63898339, -1.29515765,  1.2351028 ,  0.88406291],
       [-1.16856655, -0.10312664,  0.07755982,  0.23108517],
       [ 0.32355972,  1.43765384, -0.80850588, -0.66586999],
       [ 0.67814837, -0.09041088,  0.00673042, -0.84942379],
       [ 0.27366998, -1.60992428,  0.52995744, -0.64074151]])

You can also get a quick statistic summary of your data

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.079585 -0.538775  0.282874 -0.202026
std    0.699613  1.190249  0.695245  0.662551
min   -1.168567 -1.609924 -0.808506 -0.849424
25%   -0.132795 -1.502550  0.024438 -0.659588
50%    0.298615 -0.699142  0.303759 -0.406006
75%    0.560127 -0.093590  0.624788  0.130496
max    0.678148  1.437654  1.235103  0.884063

In [22]:
df.T # transpose of the data (doesn't alter dataframe)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.268284    0.638983   -1.168567    0.323560    0.678148    0.273670
B   -1.571681   -1.295158   -0.103127    1.437654   -0.090411   -1.609924
C    0.656398    1.235103    0.077560   -0.808506    0.006730    0.529957
D   -0.171271    0.884063    0.231085   -0.665870   -0.849424   -0.640742

In [23]:
print df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

In [24]:
df.sort_index(axis=1, ascending=False) # Sort cols descend

                   D         C         B         A
2013-01-01 -0.171271  0.656398 -1.571681 -0.268284
2013-01-02  0.884063  1.235103 -1.295158  0.638983
2013-01-03  0.231085  0.077560 -0.103127 -1.168567
2013-01-04 -0.665870 -0.808506  1.437654  0.323560
2013-01-05 -0.849424  0.006730 -0.090411  0.678148
2013-01-06 -0.640742  0.529957 -1.609924  0.273670

In [25]:
df.sort_values(by='B') #sort values by col B

                   A         B         C         D
2013-01-06  0.273670 -1.609924  0.529957 -0.640742
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-04  0.323560  1.437654 -0.808506 -0.665870

## Selection

Standard Python/NumPy expressions for selecting and setting data come in handy for interactive work but for production code it is advised to use optimized pandas data access methods, .at, .iat, .iloc and .ix. You can find more about these in the indexing documentation

### Getting

In [26]:
df['A'] # get a single column of the dataframe

2013-01-01   -0.268284
2013-01-02    0.638983
2013-01-03   -1.168567
2013-01-04    0.323560
2013-01-05    0.678148
2013-01-06    0.273670
Freq: D, Name: A, dtype: float64

In [27]:
df.A # equivalent to df['A']

2013-01-01   -0.268284
2013-01-02    0.638983
2013-01-03   -1.168567
2013-01-04    0.323560
2013-01-05    0.678148
2013-01-06    0.273670
Freq: D, Name: A, dtype: float64

We can also do numpy slicing like operations

In [28]:
df[0:3] # get rows 0 upto 3

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085

We can also use the index to slice the dataframe

In [29]:
df['20130102':'20130104'] # This is really awesome

                   A         B         C         D
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870

### Selecting by label

In [30]:
print df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

In [31]:
df.loc[dates[0]] # gets a cross-section using a label

A   -0.268284
B   -1.571681
C    0.656398
D   -0.171271
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [32]:
df.loc[:,['A','B']] # get all rows for cols A and B

                   A         B
2013-01-01 -0.268284 -1.571681
2013-01-02  0.638983 -1.295158
2013-01-03 -1.168567 -0.103127
2013-01-04  0.323560  1.437654
2013-01-05  0.678148 -0.090411
2013-01-06  0.273670 -1.609924

Can do the same using the date index for slicing. Notice that both endpts are included.

In [33]:
df.loc['20130102':'20130105',['A','B']]

                   A         B
2013-01-02  0.638983 -1.295158
2013-01-03 -1.168567 -0.103127
2013-01-04  0.323560  1.437654
2013-01-05  0.678148 -0.090411

If there is only one data index selected the number of dimensions will be reduced. Ex:

In [34]:
df.loc['20130103',['A','B']] # Dimensional reduction

A   -1.168567
B   -0.103127
Name: 2013-01-03 00:00:00, dtype: float64

In [35]:
df.loc['20130103','A']

-1.1685665513357033

An even faster method is the use the at method.

In [36]:
df.at[dates[0],'A']

-0.26828355258444364

### Selection by Position

Select via the position of the passed integers

In [37]:
print df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

In [38]:
df.iloc[3] # gets the row with index 3

A    0.323560
B    1.437654
C   -0.808506
D   -0.665870
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2] # use iloc for dataframe slicing by 
#integer positions

                   A         B
2013-01-04  0.323560  1.437654
2013-01-05  0.678148 -0.090411

Can also pass list of integer positions like numpy style

In [40]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.638983  1.235103
2013-01-03 -1.168567  0.077560
2013-01-05  0.678148  0.006730

In [41]:
df.iloc[1:3,:] #similar row slicing indexing to numpy

                   A         B         C         D
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085

In [42]:
df.iloc[:,1:3] #similar col slicing indexing to numpy

                   B         C
2013-01-01 -1.571681  0.656398
2013-01-02 -1.295158  1.235103
2013-01-03 -0.103127  0.077560
2013-01-04  1.437654 -0.808506
2013-01-05 -0.090411  0.006730
2013-01-06 -1.609924  0.529957

Get single scalar values too.

In [43]:
df.iloc[1,1]

-1.2951576476803253

### Boolean Indexing

In [44]:
print df

                   A         B         C         D
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-03 -1.168567 -0.103127  0.077560  0.231085
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

In [45]:
df[df.A > 0] # Select the rows where the A col is positive

                   A         B         C         D
2013-01-02  0.638983 -1.295158  1.235103  0.884063
2013-01-04  0.323560  1.437654 -0.808506 -0.665870
2013-01-05  0.678148 -0.090411  0.006730 -0.849424
2013-01-06  0.273670 -1.609924  0.529957 -0.640742

This is called a where operation

In [46]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.656398       NaN
2013-01-02  0.638983       NaN  1.235103  0.884063
2013-01-03       NaN       NaN  0.077560  0.231085
2013-01-04  0.323560  1.437654       NaN       NaN
2013-01-05  0.678148       NaN  0.006730       NaN
2013-01-06  0.273670       NaN  0.529957       NaN

In [47]:
df_2 = df.copy()

In [48]:
df_2['E'] = ['one','one','two', 'three', 'four', 'three']

In [49]:
print df_2

                   A         B         C         D      E
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271    one
2013-01-02  0.638983 -1.295158  1.235103  0.884063    one
2013-01-03 -1.168567 -0.103127  0.077560  0.231085    two
2013-01-04  0.323560  1.437654 -0.808506 -0.665870  three
2013-01-05  0.678148 -0.090411  0.006730 -0.849424   four
2013-01-06  0.273670 -1.609924  0.529957 -0.640742  three

In [50]:
df_2[df_2['E'].isin(['two', 'four'])] # use isin to get subset of the data meeting criteria

                   A         B        C         D     E
2013-01-03 -1.168567 -0.103127  0.07756  0.231085   two
2013-01-05  0.678148 -0.090411  0.00673 -0.849424  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [51]:
s1 = pd.Series(list(range(1,7)), index=pd.date_range('20130102', periods=6))

In [52]:
print s1 # notice that this series has one date not in df and is missing one of dfs dates

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [53]:
df['F'] = s1

In [54]:
print df # alignment is done by index, and NaN is assigned to missing dates in s1

                   A         B         C         D   F
2013-01-01 -0.268284 -1.571681  0.656398 -0.171271 NaN
2013-01-02  0.638983 -1.295158  1.235103  0.884063   1
2013-01-03 -1.168567 -0.103127  0.077560  0.231085   2
2013-01-04  0.323560  1.437654 -0.808506 -0.665870   3
2013-01-05  0.678148 -0.090411  0.006730 -0.849424   4
2013-01-06  0.273670 -1.609924  0.529957 -0.640742   5

Setting values by label

In [55]:
df.at[dates[0],'A'] = 0

Setting values by position

In [56]:
df.iat[0,1] = 0 # 0th row and 1st column

In [57]:
print df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000  0.656398 -0.171271 NaN
2013-01-02  0.638983 -1.295158  1.235103  0.884063   1
2013-01-03 -1.168567 -0.103127  0.077560  0.231085   2
2013-01-04  0.323560  1.437654 -0.808506 -0.665870   3
2013-01-05  0.678148 -0.090411  0.006730 -0.849424   4
2013-01-06  0.273670 -1.609924  0.529957 -0.640742   5

Setting values with a numpy array

In [58]:
df.loc[:,'D'] = np.array([5]*len(df))

In [59]:
print df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.656398  5 NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2
2013-01-04  0.323560  1.437654 -0.808506  5   3
2013-01-05  0.678148 -0.090411  0.006730  5   4
2013-01-06  0.273670 -1.609924  0.529957  5   5

In [60]:
df2 = df.copy() # similar deep copy operation to numpy. A true not referenced copy

In [61]:
df2[df2 > 0] = -df2 # example of a where operation with setting

In [62]:
print df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.656398 -5 NaN
2013-01-02 -0.638983 -1.295158 -1.235103 -5  -1
2013-01-03 -1.168567 -0.103127 -0.077560 -5  -2
2013-01-04 -0.323560 -1.437654 -0.808506 -5  -3
2013-01-05 -0.678148 -0.090411 -0.006730 -5  -4
2013-01-06 -0.273670 -1.609924 -0.529957 -5  -5

## Missing Data

Pandas primarily use np.nan to represent missing data. It is by default not included in computations.

Reindexing allows your to change/add/deleted the index on a specified axis. This returns a copy of the data.

In [63]:
print df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.656398  5 NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2
2013-01-04  0.323560  1.437654 -0.808506  5   3
2013-01-05  0.678148 -0.090411  0.006730  5   4
2013-01-06  0.273670 -1.609924  0.529957  5   5

In [64]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

In [65]:
print df1 # we've added a column to df using reindex. The values are NaN.

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.656398  5 NaN NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1 NaN
2013-01-03 -1.168567 -0.103127  0.077560  5   2 NaN
2013-01-04  0.323560  1.437654 -0.808506  5   3 NaN

In [66]:
df1.loc[dates[0]:dates[1],'E'] = 1 # assign the first two rows to be 1

In [67]:
print df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.656398  5 NaN   1
2013-01-02  0.638983 -1.295158  1.235103  5   1   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2 NaN
2013-01-04  0.323560  1.437654 -0.808506  5   3 NaN

We can drop rows that having missing data using the dropna function.

In [68]:
df1.dropna(how='any') # only one row should be left

                   A         B         C  D  F  E
2013-01-02  0.638983 -1.295158  1.235103  5  1  1

In [69]:
print df1 # Note droppin the data above makes a copy leaving orig. preserved

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.656398  5 NaN   1
2013-01-02  0.638983 -1.295158  1.235103  5   1   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2 NaN
2013-01-04  0.323560  1.437654 -0.808506  5   3 NaN

We can also fill in missing data using fillna

In [70]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  0.656398  5  5  1
2013-01-02  0.638983 -1.295158  1.235103  5  1  1
2013-01-03 -1.168567 -0.103127  0.077560  5  2  5
2013-01-04  0.323560  1.437654 -0.808506  5  3  5

In [71]:
print df1 # again only a copy of the data is made

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.656398  5 NaN   1
2013-01-02  0.638983 -1.295158  1.235103  5   1   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2 NaN
2013-01-04  0.323560  1.437654 -0.808506  5   3 NaN

In [72]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

## Stats

Operations in general exclude missing data.

In [73]:
df.mean() # compute the mean of each column

A    0.124299
B   -0.276828
C    0.282874
D    5.000000
F    3.000000
dtype: float64

In [74]:
df.mean(1) # compute the mean of each row

2013-01-01    1.414100
2013-01-02    1.315786
2013-01-03    1.161173
2013-01-04    1.790542
2013-01-05    1.918894
2013-01-06    1.838741
Freq: D, dtype: float64

In [75]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [76]:
s # notice how the rows have been shifted down by 2 and the unknowns filled in aith nans

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [77]:
print df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.656398  5 NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2
2013-01-04  0.323560  1.437654 -0.808506  5   3
2013-01-05  0.678148 -0.090411  0.006730  5   4
2013-01-06  0.273670 -1.609924  0.529957  5   5

In [78]:
df.sub(s, axis='index') # subtract s from each column

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -2.168567 -1.103127 -0.922440   4   1
2013-01-04 -2.676440 -1.562346 -3.808506   2   0
2013-01-05 -4.321852 -5.090411 -4.993270   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

## Apply functions to the data

In [79]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.656398  5 NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2
2013-01-04  0.323560  1.437654 -0.808506  5   3
2013-01-05  0.678148 -0.090411  0.006730  5   4
2013-01-06  0.273670 -1.609924  0.529957  5   5

In [80]:
df.apply(np.cumsum) # cumaltive sum across rows

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  0.656398   5 NaN
2013-01-02  0.638983 -1.295158  1.891501  10   1
2013-01-03 -0.529583 -1.398284  1.969061  15   3
2013-01-04 -0.206023  0.039370  1.160555  20   6
2013-01-05  0.472125 -0.051041  1.167285  25  10
2013-01-06  0.745795 -1.660966  1.697243  30  15

In [81]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.656398  5 NaN
2013-01-02  0.638983 -1.295158  1.235103  5   1
2013-01-03 -1.168567 -0.103127  0.077560  5   2
2013-01-04  0.323560  1.437654 -0.808506  5   3
2013-01-05  0.678148 -0.090411  0.006730  5   4
2013-01-06  0.273670 -1.609924  0.529957  5   5

In [82]:
df.apply(lambda x: x.max()-x.min())

A    1.846715
B    3.047578
C    2.043609
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [83]:
s = pd.Series(np.random.randint(0,7, size=10))

In [84]:
s

0    4
1    6
2    3
3    3
4    1
5    5
6    6
7    6
8    5
9    3
dtype: int64

In [85]:
s.value_counts() # histogram the values, the index is the integer and the value is the counts

6    3
3    3
5    2
4    1
1    1
dtype: int64

## String Methods

Series is equipped with a set of string processing methods in the str attribute. Pattern matching in str generally uses regular expressions.

In [86]:
s = pd.Series(['A','B','C','Aaa', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [87]:
s

0       A
1       B
2       C
3     Aaa
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [88]:
s.str.lower()

0       a
1       b
2       c
3     aaa
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

Pandas provides various ways to combine Series, DataFrame and Panel objectswith various kinds of set logic for the indexes.

### Concatenate

In [90]:
df = pd.DataFrame(np.random.randn(10,4))

In [91]:
df

          0         1         2         3
0  1.302451  0.244174  2.079667  0.663010
1 -0.131906  0.182554 -1.625931  0.958537
2  0.387235  0.970446  0.357683 -0.661344
3 -0.353928 -0.041824 -0.087599  0.337687
4  0.271218 -0.654263 -0.080798  0.015529
5 -0.317250  2.010769 -0.317369  0.448147
6 -0.323808 -1.320310 -0.488155 -0.317611
7 -0.565978 -1.136399 -0.570051  0.813153
8 -0.349880 -0.129785 -0.391602  0.922338
9 -1.067314  0.756007  0.879440 -0.089447

In [92]:
pieces = [df[:3], df[3:7], df[7:]]

In [93]:
pieces # break the DataFrame into three DataFrames

[          0         1         2         3
 0  1.302451  0.244174  2.079667  0.663010
 1 -0.131906  0.182554 -1.625931  0.958537
 2  0.387235  0.970446  0.357683 -0.661344,
           0         1         2         3
 3 -0.353928 -0.041824 -0.087599  0.337687
 4  0.271218 -0.654263 -0.080798  0.015529
 5 -0.317250  2.010769 -0.317369  0.448147
 6 -0.323808 -1.320310 -0.488155 -0.317611,
           0         1         2         3
 7 -0.565978 -1.136399 -0.570051  0.813153
 8 -0.349880 -0.129785 -0.391602  0.922338
 9 -1.067314  0.756007  0.879440 -0.089447]

In [94]:
pd.concat(pieces) # concatenate the pieces back together along rows

          0         1         2         3
0  1.302451  0.244174  2.079667  0.663010
1 -0.131906  0.182554 -1.625931  0.958537
2  0.387235  0.970446  0.357683 -0.661344
3 -0.353928 -0.041824 -0.087599  0.337687
4  0.271218 -0.654263 -0.080798  0.015529
5 -0.317250  2.010769 -0.317369  0.448147
6 -0.323808 -1.320310 -0.488155 -0.317611
7 -0.565978 -1.136399 -0.570051  0.813153
8 -0.349880 -0.129785 -0.391602  0.922338
9 -1.067314  0.756007  0.879440 -0.089447

### Join 
Join allows for sql style merging.

In [95]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1,2]})

In [96]:
right = pd.DataFrame({'key':['foo','foo'], 'rval': [4,5]})

In [97]:
left

   key  lval
0  foo     1
1  foo     2

In [98]:
right

   key  rval
0  foo     4
1  foo     5

In [99]:
pd.merge(left,right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append
Append rows to a dataframe

In [100]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])

In [101]:
df

          A         B         C         D
0 -0.345488  0.064382 -1.243279  0.737227
1 -1.284658 -1.700822 -0.285445 -0.656152
2 -0.073864  1.797626  0.494840 -0.973102
3 -0.855085 -0.271339 -0.103887  0.494267
4 -0.553043 -0.598485  0.383575 -1.097962
5 -0.689159  1.401655 -1.445248  0.499457
6  1.846589 -0.239024  0.720220 -1.589608
7 -0.237188 -0.994868 -0.351808 -2.103982

In [104]:
s = df.iloc[3] # get the third row

In [103]:
s

A   -0.855085
B   -0.271339
C   -0.103887
D    0.494267
Name: 3, dtype: float64

In [108]:
df.append(s, ignore_index=True) #append third row to end of dataframe

          A         B         C         D
0 -0.345488  0.064382 -1.243279  0.737227
1 -1.284658 -1.700822 -0.285445 -0.656152
2 -0.073864  1.797626  0.494840 -0.973102
3 -0.855085 -0.271339 -0.103887  0.494267
4 -0.553043 -0.598485  0.383575 -1.097962
5 -0.689159  1.401655 -1.445248  0.499457
6  1.846589 -0.239024  0.720220 -1.589608
7 -0.237188 -0.994868 -0.351808 -2.103982
8 -0.855085 -0.271339 -0.103887  0.494267

## Grouping

By "group by" we are referring to a process involving one or more of the following steps.
* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [111]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                  'foo', 'bar', 'foo', 'foo'],
   ....:           'B' : ['one', 'one', 'two', 'three',
   ....:                  'two', 'two', 'one', 'three'],
   ....:           'C' : np.random.randn(8),
   ....:           'D' : np.random.randn(8)})

In [110]:
df

     A      B         C         D
0  foo    one  1.547411 -0.256059
1  bar    one  1.642487 -1.147014
2  foo    two -0.448321 -0.387784
3  bar  three  0.692884  1.000350
4  foo    two  0.988694  1.624827
5  bar    two  0.785903 -0.261461
6  foo    one  0.739926  0.493399
7  foo  three  1.279778  0.485468

Grouping and then applying sum func to the resulting groups.

In [112]:
df.groupby('A').sum()

            C         D
A
bar  0.344755  3.677260
foo -0.911247 -0.824072